---
kind: type
id: T:Autodesk.Revit.DB.Visual.PlasticvinylType
source: html/1639ab60-92da-1f33-af9f-9b79cbc7cd31.htm
---
# Autodesk.Revit.DB.Visual.PlasticvinylType

The enumerated type representing the permitted values for the asset property "PlasticvinylType" from the "PlasticVinyl" schema.

## Syntax (C#)
```csharp
public enum PlasticvinylType
```